chamber_mrf/home/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// STL Surface Bounding Box : (-0.33 -0.3 -0.1305) (0.27 0.61 0.1245)
// BG Mesh Bounding Box : (-0.34 -0.31 -0.14) (0.28 0.62 0.13)

scale       0.001;

x_min       -340;
x_max       280;   //#eval "$x0 + 1.0";
y_min       -310;
y_max       620;
z_min       -140;
z_max       130;

cellSize    10;

nx          #eval "floor( ($x_max - $x_min) / $cellSize )";
ny          #eval "floor( ($y_max - $y_min) / $cellSize )";
nz          #eval "floor( ($z_max - $z_min) / $cellSize )";

//gr       40.0;
//grInv    #eval "1/$gr";

vertices
(
    ($x_min $y_min $z_min)
    ($x_max $y_min $z_min)
    ($x_max $y_max $z_min)
    ($x_min $y_max $z_min)
    ($x_min $y_min $z_max)
    ($x_max $y_min $z_max)
    ($x_max $y_max $z_max)
    ($x_min $y_max $z_max)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);


// ************************************************************************* //
