chamber_mrf/home/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;            // psiThermo, psiReactionThermo
                //  heRhoThermo;            // rhoThermo, rhoReactionThermo, multiphaseMixtureThermo
                //  heheuPsiThermo;         // psiuReactionThermo
    mixture         pureMixture;            // fixed composition, requires sub-dictionary "mixture"
                //  reactingMixture;        // variable composition, requires "foamChemistryFile"
                //  homogeneousMixture;         // laminar flame speed & regress variables
                //  inhomogeneousMixture;       // "fuel", "oxidant", "burntProducts"
                //  veryInhomogeneousMixture;   //
                //  egrMixture;
                //  multiComponewntMixture;
                //  singleStepReactingMixture;
    transport       const;                  // constant mu & Prandtl number Pr=Cp*mu/kappa, "mu" & "Pr"
                //  sutherland;             // calculates mu as a function of temperature T from "As" & "Ts"
                //  polynomial;             // calculates mu and kappa as a function of temperature T
                //  logPolynomial;          // calculates ln(mu) & ln(kappa) as a function of ln(T)
    thermo          hConst;                 // constant "Cp" & heat of fusion "Hf"
                //  eConst;                 // constant "Cv" & heaf of fusion "Hf"
                //  janaf;                  // calculates "Cp" as a function of temperature T from "JANAF" table
                //  hPolynomial;            // calculates "Cp" as a function of temperature by polynomial
    equationOfState
                    perfectGas;                 // rho = 1 / R*T * P
                //  rhoConst;                   // rho = constant
                //  incompressiblePerfectGas;   // rho = 1 / R*T * Pref
                //  perfectFluid;               // rho = 1 / R*T * P + rho0
                //  linear;                     // rho = Psi * P + rho0
                //  adiabaticPerfectFluid;      // rho = rho0 * ( (P + B) / (P0 + B) )^(1/gamma)
                //  Boussinesq;                 // rho = rho0 * [ 1 - beta ( T - T0 ) ]
                //  PengRobinsonGas;            // rho = 1 / (z * R * T) * P
                //  icoPolymial;
    specie          specie;                 // only option, specified by "nMoles" & "molWeight"
    energy          sensibleInternalEnergy; // internal energy U
                //  sensibleEnthalpy;       // enthalpy H = U + p*V
                //  absoluteEnthalpy;       // heat of formation included
}

air              // air at room temperature (293 K)
{
    specie
    {
        nMoles      1;  // only for combution based on regress variable /w homogeneous mixture of reactants
        molWeight   28.96;
    }
    thermodynamics
    {
        Cp          1004.5;
        Hf          2.544e+06;
    }
    transport
    {
        mu          1.82e-05;
        Pr          0.71;
    }
}

fuel
{
    specie
    {
        nMoles      1;
        molWeight   16.0428;
    }
    thermodynamics      // janaf thermodynamics
    {
        Tlow        200;
        Thigh       6000;
        Tcommon     1000;
        highCpCoeffs    (1.63543 0.0100844 -3.36924e-06 5.34973e-10
                         -3.15528e-14 -10005.6 9.9937);
        lowCpCoeffs     (5.14988 -0.013671 4.91801e-05 -4.84744e-08
                         1.66694e-11 -10246.6 -4.64132);
    }
    tranport            // sutherland transport
    {
        As          1.67212e-06;
        Ts          170.672;
    }
}
// ************************************************************************* //
